# Pandas

- Pandas is one of the most important Library
- It helps in Data Structure, Data frames
- It reads, raw files like csv's, tsv's, excel files
- It can do various operations

### Installing Pandas

`
pip install pandas
or 
conda install pandas
`

- Importing a dataset
- What all we can do after loading the dataset
    - Column Names
    - Data Types
    - info
    - describe
    - Shape
    - head
    - tail
    - unique
- How to create DataFrame
- Settings Indexes for a DataFrame
- Exporting a dataset

### Importing a dataset

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('./Random_BSE_Data.csv')

In [52]:
data

,Date,Open,High,Low,Close,Adj Close,Volume
0,4/16/2019,39040.30078,39364.33984,39038.80859,39275.64063,39275.64063,14400.0
1,4/18/2019,39420.03906,39487.44922,39083.16016,39140.28125,39140.28125,14600.0
2,4/22/2019,39158.21875,39158.21875,38585.64844,38645.17969,38645.17969,14900.0
3,4/23/2019,38771.26953,38832.60938,38518.26172,38564.87891,38564.87891,11600.0
4,4/24/2019,38672.62891,39095.35156,38571.00000,39054.67969,39054.67969,15200.0
...,...,...,...,...,...,...,...
238,4/8/2020,29701.91992,31227.97070,29602.93945,29893.96094,29893.96094,24700.0
239,4/9/2020,30571.18945,31225.19922,30420.22070,31159.61914,31159.61914,18800.0
240,4/13/2020,31195.72070,31195.72070,30474.15039,30690.01953,30690.01953,16100.0
241,4/15/2020,31277.10938,31568.35938,30222.07031,30379.81055,30379.81055,23600.0
242,4/16/2020,30095.50977,30704.35938,30016.16992,30620.31055,30620.31055,0.0

In [4]:
# Column
data.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

In [5]:
# data types
data.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume       float64
dtype: object

In [6]:
# info
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 243 entries, 0 to 242
Data columns (total 7 columns):
Date         243 non-null object
Open         240 non-null float64
High         239 non-null float64
Low          241 non-null float64
Close        240 non-null float64
Adj Close    239 non-null float64
Volume       241 non-null float64
dtypes: float64(6), object(1)
memory usage: 13.4+ KB

In [7]:
# describe
data.describe()

,Open,High,Low,Close,Adj Close,Volume
count,240.000000,239.000000,241.000000,240.000000,239.000000,241.000000
mean,38572.751140,38785.033228,38170.093289,38474.347633,38477.977160,23935.269710
std,3122.622534,2964.873516,3374.368161,3160.614446,3140.626046,16337.588333
min,26499.810550,27462.869140,25638.900390,25981.240230,25981.240230,0.000000
25%,37624.528320,37751.115235,37358.488280,37522.515625,37513.050780,14100.000000
50%,39146.750000,39361.058590,38882.988280,39093.585940,39090.031250,21000.000000
75%,40593.109373,40747.089845,40336.558590,40509.365238,40531.300785,30600.000000
max,42263.000000,42273.871090,41850.289060,41952.628910,41952.628910,141500.000000

In [8]:
# column data type individually
data['Open'].dtypes

dtype('float64')

In [9]:
# Shape
data.shape

(243, 7)

In [10]:
# no of rows using shape
data.shape[0]

243

In [11]:
# no of columns of using shape
data.shape[1]

7

In [12]:
# head
data.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,4/16/2019,39040.30078,39364.33984,39038.80859,39275.64063,39275.64063,14400.0
1,4/18/2019,39420.03906,39487.44922,39083.16016,39140.28125,39140.28125,14600.0
2,4/22/2019,39158.21875,39158.21875,38585.64844,38645.17969,38645.17969,14900.0
3,4/23/2019,38771.26953,38832.60938,38518.26172,38564.87891,38564.87891,11600.0
4,4/24/2019,38672.62891,39095.35156,38571.00000,39054.67969,39054.67969,15200.0

In [13]:
data.head(3)

,Date,Open,High,Low,Close,Adj Close,Volume
0,4/16/2019,39040.30078,39364.33984,39038.80859,39275.64063,39275.64063,14400.0
1,4/18/2019,39420.03906,39487.44922,39083.16016,39140.28125,39140.28125,14600.0
2,4/22/2019,39158.21875,39158.21875,38585.64844,38645.17969,38645.17969,14900.0

In [14]:
data.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
238,4/8/2020,29701.91992,31227.97070,29602.93945,29893.96094,29893.96094,24700.0
239,4/9/2020,30571.18945,31225.19922,30420.22070,31159.61914,31159.61914,18800.0
240,4/13/2020,31195.72070,31195.72070,30474.15039,30690.01953,30690.01953,16100.0
241,4/15/2020,31277.10938,31568.35938,30222.07031,30379.81055,30379.81055,23600.0
242,4/16/2020,30095.50977,30704.35938,30016.16992,30620.31055,30620.31055,0.0

In [15]:
data.tail(3)

,Date,Open,High,Low,Close,Adj Close,Volume
240,4/13/2020,31195.72070,31195.72070,30474.15039,30690.01953,30690.01953,16100.0
241,4/15/2020,31277.10938,31568.35938,30222.07031,30379.81055,30379.81055,23600.0
242,4/16/2020,30095.50977,30704.35938,30016.16992,30620.31055,30620.31055,0.0

In [16]:
# unique function
data.Volume.unique()

array([ 14400.,  14600.,  14900.,  11600.,  15200.,  17300.,  30900.,
        26200.,  14800.,  13400.,  15600.,  13100.,  15300.,  19700.,
        17800.,  17700.,  19400.,  15700.,  18800.,  26400.,  22700.,
        28100.,  17100.,  16000.,  12800.,  17500.,  34600.,  11900.,
        18700.,  16200.,  14200.,  11700.,  21800.,  20600.,  12700.,
        18500.,  20100.,  11300.,  15000.,  13200.,  11200.,  10800.,
        13800.,  14500.,  26000.,  22000.,  12900.,  18000.,  25100.,
        23400.,  24100.,  19200.,  23000.,  19300.,  16600.,  21100.,
        22800.,  27200.,  21000.,  25900.,  25400.,  25300.,  27400.,
        28600.,  22500.,  26100.,  20900.,  28500.,  33100.,  38400.,
        35600.,  36500.,  31700.,  33400.,  23600.,  25600.,  36700.,
        27500.,  34300.,  19900.,  20500.,  61000.,   2800.,  30600.,
        28800.,  33200.,  39200.,  49000.,  75400.,  59200.,  52900.,
        40400.,  36400.,  27300.,  39400.,  47100.,  42400.,  54500.,
        41000.,  36600.,  48600.,     nan,  50500.,  37200.,  87900.,
        57000.,  62600.,  45400.,  37700.,  30200.,  42600.,  29500.,
        27800.,  25800.,  28700.,  39100.,  32300.,  21700.,  32800.,
        32400.,  46700.,  39800.,  33700.,  44500.,  33000.,  32600.,
        31400.,  55500.,  41300.,  27900.,  21600.,  19000.,  24300.,
        33300.,  33600.,   6200.,   4400.,   5600.,   6100.,   5700.,
         5300.,   8900.,   8700.,  18200.,   7800.,  10600.,  14100.,
         6600.,   9500.,   7500.,   7700.,   9900.,   7000.,   9800.,
         6700.,  11500.,  13900.,   9600.,   9100.,   6900.,  12300.,
         8400.,   8100.,   7300.,   9000.,  13500.,  25200.,  18100.,
        21500.,  31300.,  32100.,  24700., 141500.,  35000., 116900.,
        23200.,  18900.,  21900.,  16100.,      0.])

In [17]:
# data frames
df = pd.DataFrame({'Name':['Sachin', 'Sehwag', 'Ganguly', 'Zaheer'],
                  'Age':[25, 35, 33, 35],
                  'Location': ['Mumbai', 'Delhi', 'Kolkata', 'Mumbai']})

In [18]:
df

      Name  Age Location
0   Sachin   25   Mumbai
1   Sehwag   35    Delhi
2  Ganguly   33  Kolkata
3   Zaheer   35   Mumbai

In [19]:
# setting index values
df.index = ['First', 'Second', 'Third', 'Fourth']

In [20]:
df

           Name  Age Location
First    Sachin   25   Mumbai
Second   Sehwag   35    Delhi
Third   Ganguly   33  Kolkata
Fourth   Zaheer   35   Mumbai

In [21]:
# You can view indivual columns though
df[['Name']]

           Name
First    Sachin
Second   Sehwag
Third   Ganguly
Fourth   Zaheer

In [22]:
df.Name

First      Sachin
Second     Sehwag
Third     Ganguly
Fourth     Zaheer
Name: Name, dtype: object

In [23]:
# Slicing a DF
df[0:2]

          Name  Age Location
First   Sachin   25   Mumbai
Second  Sehwag   35    Delhi

In [24]:
# Using loc and iloc
df.loc[['First']]

         Name  Age Location
First  Sachin   25   Mumbai

In [25]:
df.loc[['Second']]

          Name  Age Location
Second  Sehwag   35    Delhi

In [26]:
df.loc[['First', 'Third']]

          Name  Age Location
First   Sachin   25   Mumbai
Third  Ganguly   33  Kolkata

### Manipulating the datasets

In [27]:
# Changing the data type of a attribute
df = pd.DataFrame({'ID': [1, 2,3,4]})
df
df['ID'].astype(float)

0    1.0
1    2.0
2    3.0
3    4.0
Name: ID, dtype: float64

In [28]:
# frequency distribution
df = pd.DataFrame({'Grade': ['A', 'B', 'C', 'A', 'A', 'B']})

In [29]:
df

  Grade
0     A
1     B
2     C
3     A
4     A
5     B

In [30]:
df['Grade'].value_counts()

A    3
B    2
C    1
Name: Grade, dtype: int64

In [31]:
df = pd.DataFrame({'Name':['Sachin', 'Sehwag', 'Ganguly', 'Zaheer'],
                  'Age':[25, 35, 33, 35],
                  'Location': ['Mumbai', 'Delhi', 'Kolkata', 'Mumbai']})

In [32]:
# cross tabs
pd.crosstab(df.Name, df.Age)

Age      25  33  35
Name
Ganguly   0   1   0
Sachin    1   0   0
Sehwag    0   0   1
Zaheer    0   0   1

In [33]:
# we can set any column as index
df.set_index('Name')

         Age Location
Name
Sachin    25   Mumbai
Sehwag    35    Delhi
Ganguly   33  Kolkata
Zaheer    35   Mumbai

In [34]:
# to reset 
df.reset_index(inplace=True)

In [35]:
# sorting data
df.sort_values('Age')

   index     Name  Age Location
0      0   Sachin   25   Mumbai
2      2  Ganguly   33  Kolkata
1      1   Sehwag   35    Delhi
3      3   Zaheer   35   Mumbai

In [36]:
# Renaming columns
df.columns = ['Cricketer', 'Age', 'Loc']

ValueError: Length mismatch: Expected axis has 4 elements, new values have 3 elements

In [37]:
df

   index     Name  Age Location
0      0   Sachin   25   Mumbai
1      1   Sehwag   35    Delhi
2      2  Ganguly   33  Kolkata
3      3   Zaheer   35   Mumbai

In [38]:
# or you can also rename like below
df.rename(columns = {'Loc':'Location'}, inplace=True)

In [39]:
df

   index     Name  Age Location
0      0   Sachin   25   Mumbai
1      1   Sehwag   35    Delhi
2      2  Ganguly   33  Kolkata
3      3   Zaheer   35   Mumbai

In [40]:
# Dropping rows and columns
# inplace True will make permanent changes
df.drop('Location', axis=1)

   index     Name  Age
0      0   Sachin   25
1      1   Sehwag   35
2      2  Ganguly   33
3      3   Zaheer   35

In [41]:
df

   index     Name  Age Location
0      0   Sachin   25   Mumbai
1      1   Sehwag   35    Delhi
2      2  Ganguly   33  Kolkata
3      3   Zaheer   35   Mumbai

In [42]:
df['New_Variable'] = df.Age * 2

In [43]:
df

   index     Name  Age Location  New_Variable
0      0   Sachin   25   Mumbai            50
1      1   Sehwag   35    Delhi            70
2      2  Ganguly   33  Kolkata            66
3      3   Zaheer   35   Mumbai            70

In [44]:
# Group by
df_agg = pd.DataFrame({'Name':['Hyderabad', 'Bangalore', 'Hyderabad', 'Bangalore'],
                      'Tot': [323, 333,500,253]})

In [45]:
df_agg

        Name  Tot
0  Hyderabad  323
1  Bangalore  333
2  Hyderabad  500
3  Bangalore  253

In [46]:
df_agg.groupby('Name').Tot.min()

Name
Bangalore    253
Hyderabad    323
Name: Tot, dtype: int64

In [47]:
df_agg.groupby('Name').Tot.min()

Name
Bangalore    253
Hyderabad    323
Name: Tot, dtype: int64

### Filtering
- using index
- using isin

In [50]:
df_agg[df_agg.index==2]

        Name  Tot
2  Hyderabad  500

In [51]:
df_agg[df_agg.index.isin([1,3])]

        Name  Tot
1  Bangalore  333
3  Bangalore  253

### Missing values in pandas

In [53]:
data

,Date,Open,High,Low,Close,Adj Close,Volume
0,4/16/2019,39040.30078,39364.33984,39038.80859,39275.64063,39275.64063,14400.0
1,4/18/2019,39420.03906,39487.44922,39083.16016,39140.28125,39140.28125,14600.0
2,4/22/2019,39158.21875,39158.21875,38585.64844,38645.17969,38645.17969,14900.0
3,4/23/2019,38771.26953,38832.60938,38518.26172,38564.87891,38564.87891,11600.0
4,4/24/2019,38672.62891,39095.35156,38571.00000,39054.67969,39054.67969,15200.0
...,...,...,...,...,...,...,...
238,4/8/2020,29701.91992,31227.97070,29602.93945,29893.96094,29893.96094,24700.0
239,4/9/2020,30571.18945,31225.19922,30420.22070,31159.61914,31159.61914,18800.0
240,4/13/2020,31195.72070,31195.72070,30474.15039,30690.01953,30690.01953,16100.0
241,4/15/2020,31277.10938,31568.35938,30222.07031,30379.81055,30379.81055,23600.0
242,4/16/2020,30095.50977,30704.35938,30016.16992,30620.31055,30620.31055,0.0

In [54]:
data.isnull()

      Date   Open   High    Low  Close  Adj Close  Volume
0    False  False  False  False  False      False   False
1    False  False  False  False  False      False   False
2    False  False  False  False  False      False   False
3    False  False  False  False  False      False   False
4    False  False  False  False  False      False   False
..     ...    ...    ...    ...    ...        ...     ...
238  False  False  False  False  False      False   False
239  False  False  False  False  False      False   False
240  False  False  False  False  False      False   False
241  False  False  False  False  False      False   False
242  False  False  False  False  False      False   False

[243 rows x 7 columns]

In [55]:
data.isnull().sum()

Date         0
Open         3
High         4
Low          2
Close        3
Adj Close    4
Volume       2
dtype: int64

### Ranking in DataFrames

In [56]:
data.rank()

      Date   Open   High    Low  Close  Adj Close  Volume
0    128.0  107.0  121.0  132.0  129.0      129.0    63.5
1    130.0  131.0  127.0  134.0  126.0      126.0    66.5
2    131.0  121.0  106.0  101.0   95.0       95.0    71.5
3    132.0   94.0   87.0   97.0   90.0       90.0    43.5
4    133.0   86.0  100.0  100.0  116.0      116.0    75.5
..     ...    ...    ...    ...    ...        ...     ...
238  139.0   11.0   16.0   15.0   11.0       10.0   144.5
239  140.0   13.0   15.0   19.0   18.0       18.0   106.5
240  126.0   16.0   14.0   20.0   17.0       17.0    87.0
241  127.0   18.0   17.0   17.0   15.0       14.0   138.5
242  129.0   12.0   11.0   16.0   16.0       16.0     1.0

[243 rows x 7 columns]

In [58]:
df_agg

        Name  Tot
0  Hyderabad  323
1  Bangalore  333
2  Hyderabad  500
3  Bangalore  253

In [59]:
df_agg.rank()

   Name  Tot
0   3.5  2.0
1   1.5  3.0
2   3.5  4.0
3   1.5  1.0

### Concatenating DFs

In [62]:
df_agg

        Name  Tot
0  Hyderabad  323
1  Bangalore  333
2  Hyderabad  500
3  Bangalore  253

In [68]:
df_agg_2 = pd.DataFrame({'Name':['Charan', 'Teja', 'Hello', 'Lucy'],
                       'Tot':[12,15,55,96]
                        })

In [73]:
df_concat = pd.concat([df_agg, df_agg_2])

In [74]:
df_concat

        Name  Tot
0  Hyderabad  323
1  Bangalore  333
2  Hyderabad  500
3  Bangalore  253
0     Charan   12
1       Teja   15
2      Hello   55
3       Lucy   96

### Series

In [75]:
pd.Series([1, 2, 'D'])

0    1
1    2
2    D
dtype: object

In [78]:
pd.Series({1:'a', 2:'b'})

1    a
2    b
dtype: object